app/controllers/home_controller.rb

  def index
    @users = User.all
    @posts = Post.all
    @comments = Comment.all
    @posts = Post.paginate(:page => params[:page], :per_page => 6)
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC
SELECT "comments".* FROM "comments"
SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"