app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
      def index
        @posts = Post.paginate(:page => params[:page])

INSERT INTO "posts" ("category", "content", "created_at", "image", "tag", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
        if user_signed_in?
        @post = Post.new(params[:post])
        @post.user_id = current_user.id
          respond_to do |format|
              if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", 7]]
UPDATE "posts" SET "content" = 'Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..Here I am..', "image" = NULL, "updated_at" = '2013-05-16 10:42:53.510041' WHERE "posts"."id" = 7
---
  def update
    @post = Post.find(params[:id])
      respond_to do |format|
        if @post.update_attributes(params[:post])